turbine_run/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField      uniform (0.3 0 0);

boundaryField
{
    blade1
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    blade2
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    blade3
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    AMI_in
    {
        type  		cyclicAMI;
        value   	$internalField;
    }
    AMI_out
    {
        type  		cyclicAMI;
        value   	$internalField;
    }
    inlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}
// ************************************************************************* //
