turbine_run/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField      uniform 4e-6;

boundaryField
{
    blade1
    {
        type            nutUSpaldingWallFunction;
//        type		  fixedValue;
        value           uniform 0;
    }
    blade2
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    blade3
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    AMI_in
    {
        type            cyclicAMI;
        value   	$internalField;
    }
    AMI_out
    {
        type            cyclicAMI;
        value   	$internalField;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
