turbine_run/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField      uniform 0;

boundaryField
{
    blade1
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    blade2
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    blade3
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    AMI_in
    {
        type            cyclicAMI;
        value   	$internalField;
    }
    AMI_out
    {
        type            cyclicAMI;
        value   	$internalField;
    }
    "(inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
