turbine_run/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\\

pointSync false;
patches
(
    {
        name                AMI_out;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  AMI_in;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (interface_out);
    }
    {
        name                AMI_in;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  AMI_out;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (interface_in);
    }

);

